{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 7, 11], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [null, 7, 11], "name": "input_2", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "LSTM", "name": "lstm_1", "config": {"kernel_regularizer": null, "return_sequences": false, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "units": 11, "recurrent_dropout": 0.0, "bias_constraint": null, "name": "lstm_1", "return_state": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "unroll": false, "recurrent_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "unit_forget_bias": true, "dropout": 0.0}}, {"inbound_nodes": [[["input_2", 0, 0, {}], ["lstm_1", 0, 1, {}], ["lstm_1", 0, 2, {}]]], "class_name": "LSTM", "name": "lstm_2", "config": {"kernel_regularizer": null, "return_sequences": true, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "units": 11, "recurrent_dropout": 0.0, "bias_constraint": null, "name": "lstm_2", "return_state": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "unroll": false, "recurrent_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "unit_forget_bias": true, "dropout": 0.0}}, {"inbound_nodes": [[["lstm_2", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "activation": "softmax", "bias_constraint": null, "kernel_regularizer": null, "units": 11, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "dense_1", "activity_regularizer": null}}], "output_layers": [["dense_1", 0, 0]]}}